{
  "mailtoTarget": "marketing@posta.si",
  "profiles": {
    "podatkovni": { "label": "Podatkovni marketing", "color": "#3b82f6" },
    "produktni": { "label": "Produktni marketing", "color": "#22c55e" },
    "performance": { "label": "Performance / oglaševalski marketing", "color": "#f59e0b" },
    "ne_vem": { "label": "Še ne vem", "color": "#8b5cf6" }
  },
  "emails": {
    "podatkovni": {
      "immediate": {
        "subject": "Tvoj marketinški profil: Podatkovni marketing",
        "body": "<h1 style=\"color:#3b82f6;\">Zdravo {{name}}!</h1>\n<p>Izbral/a si profil: <strong>Podatkovni marketing</strong>.</p>\n<p>Če želiš graditi marketinški sistem, moraš razumeti podatke.</p>\n<p>Podatki niso več poročilo na koncu kampanje. Predstavljaj si, da služijo kot navigacija v realnem času. Se pravi reagiraš proaktivno in ne reaktivno.</p>\n\n<p><strong>Za začetek se osredotoči na tri stvari:</strong></p>\n<ul>\n  <li>Razumi razliko med metrikami (CAC, LTV, churn, konverzija…).</li>\n  <li>Nauči se brati dashboarde brez pomoči analitika.</li>\n  <li>Razmišljaj v segmentih, ne v \"vseh uporabnikih\". Komuniciraš sicer z manjšim številom uporabnikov, ampak bolj ciljanim in relevantnim sporočilom. Kot jaz zdaj, na primer.</li>\n</ul>\n\n<p><strong>Na področju AI se osredotoči na:</strong></p>\n<ul>\n  <li>analizo podatkov z uporabo LLM (razlaga vzorcev, iskanje anomalij…). Trenutno je pri tem najboljši Claude, ker uporablja daljši kontekst in je zelo zanesljiv pri delu z večjimi datotekami in strukturirani pripravi podatkov.</li>\n  <li>clustering uporabnikov (iskanje segmentov na podlagi vedenja, preferenc ali demografskih lastnosti)</li>\n  <li>napovedne modele (verjetnost nakupa, odhoda…)</li>\n</ul>\n\n<p><strong>Uporabne AI rešitve:</strong></p>\n<ul>\n  <li>ChatGPT (Advanced Data Analysis), Gemini Advanced ali Claude za analizo CSV datotek (lahko tudi neposredno v Excelu). Bodi pazljiv pri Claude, ker ne blesti pri Slovenščini.</li>\n  <li>PostHog (produktna analitika) + AI analiza dogodkov in vedenjskih vzorcev</li>\n  <li>Google Analytics + BigQuery sandbox za naprednejšo analitiko in modeliranje</li>\n  <li>Orodja za napovedno analitiko (npr. AutoML, Vertex ali podobne platforme)</li>\n  <li>Poleg klasike (Looker Studio) lahko preizkusiš Power BI Copilot ali Tableau Ask Data. To ti omogoča, da v pogovornem jeziku \"vprašaš podatke\" in dobiš vpoglede, ne da bi napisal SQL query.</li>\n</ul>\n\n<p>Ključno ni orodje, ampak sposobnost postaviti pravo vprašanje podatkom in iz odgovora narediti odločitev.</p>\n<p>Ne se ustrašiti količine področij, ki sem jih naštel. Ne rabiš znati vsega naenkrat. Pojdi korak za korakom. Imaš še dovolj časa, da se nadgradiš.</p>\n<p>Že to, da ti nekdo iz trga jasno pove, katere kompetence postajajo pomembne, je tvoja konkurenčna prednost. Večina tega nima, ampak na tebi je, da jo izkoristiš.</p>\n<p>Jaz sem se iskal do 30. leta. In sem se kljub temu našel in začel graditi competence.</p>\n\n<div style=\"background:#f3f4f6;padding:20px;border-radius:8px;margin-top:24px;\">\n  <p style=\"margin-top:0;\"><strong>Mini izziv:</strong></p>\n  <p>Predstavljaj si, da ima MojaPošta 100.000 aktivnih uporabnikov.</p>\n  <ul>\n    <li>Katere 3 segmente bi oblikoval/a na podlagi vedenja uporabnikov in zakaj?</li>\n    <li>Katere metrike bi spremljal/a pri vsakem segmentu?</li>\n    <li>Katere dodatne podatke bi potreboval/a, da bi se lahko odločil/a o konkretni produktni spremembi (npr. ali aplikacija potrebuje zemljevid lokacij)? Kako bi na podlagi teh podatkov sprejel/a odločitev?</li>\n  </ul>\n</div>"
      },
      "results": {
        "subject": "Rezultati ankete – pogled v podatke",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Tukaj je razporeditev profilov:</p>\n<ul>{{resultsHtml}}</ul>\n<p>Podatki brez interpretacije so samo številke. Pravilna interpretacija podatkov je lahko tvoja konkurenčna prednost.</p>\n<p>Ko tehnična ovira za analizo pada in ima skoraj vsak dostop do istih orodij, bo razlika v tem, kdo zna iz podatkov ustvariti odločitev, ne samo poročilo.</p>"
      },
      "reminder": {
        "subject": "Si oblikoval/a svoje segmente?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Si pripravil/a 3 segmente in metrike?</p>\n<p>Kaj pa produktna sprememba?</p>\n<p>Če želiš, mi pošlji svojo logiko segmentacije ter pristop k produktni spremembi. Z veseljem ti podam kratek komentar.</p>\n<p><a href=\"{{mailtoLink}}\" style=\"display:inline-block;padding:12px 24px;background:#3b82f6;color:#fff;border-radius:8px;text-decoration:none;\">Pošlji odgovor</a></p>"
      }
    },
    "produktni": {
      "immediate": {
        "subject": "Tvoj marketinški profil: Produktni marketing",
        "body": "<h1 style=\"color:#22c55e;\">Zdravo {{name}}!</h1>\n<p>Izbral/a si produktni marketing. Produkt je danes najmočnejši marketinški kanal.</p>\n\n<p><strong>Osredotoči se na:</strong></p>\n<ul>\n  <li>jasno vrednostno ponudbo za vsak segment,</li>\n  <li>razumevanje uporabniške poti,</li>\n  <li>razlikovanje med funkcionalnostjo in vrednostjo.</li>\n</ul>\n\n<p><strong>Na področju AI se osredotoči na:</strong></p>\n<ul>\n  <li>analizo uporabniških feedbackov (sentiment, povzetki intervjujev),</li>\n  <li>generiranje različnih value proposition za testiranje,</li>\n  <li>sintezo insightov iz raziskav.</li>\n</ul>\n\n<p><strong>Uporabne AI rešitve:</strong></p>\n<ul>\n  <li>ChatGPT, Gemini ali Claude za povzetke intervjujev in feedbacka</li>\n  <li>Notion AI za strukturiranje raziskav</li>\n  <li>Typeform + AI analiza odgovorov</li>\n  <li>Lovable, Replit in podobne rešitve za hitro prototipiranje idej</li>\n</ul>\n\n<p><strong>Pomembno:</strong> prototipiranje ni \"no-code igranje\".</p>\n<ul>\n  <li>Cilj je razumeti logiko produkta, tok podatkov in vrednost za uporabnika.</li>\n  <li>Če te zanima bolj napreden pristop, lahko greš še korak dlje:</li>\n  <li>Claude Code ali podoben AI coding asistent za razvoj funkcionalnosti</li>\n  <li>GitHub za verzioniranje in sodelovanje</li>\n  <li>Vercel za deployment aplikacij (to pomeni objavo oz. prehod v produkcijo)</li>\n</ul>\n\n<p>Če želiš, ti lahko pošljem tudi svoj trenutni \"tech stack\" (rešitve, ki jih uporabljam) za razvoj spletnih aplikacij, da vidiš, kako izgleda sistem v praksi.</p>\n<p>Ne ustraši se širine področja. Produktni marketing zahteva kombinacijo razmišljanja, analize in eksperimentiranja. Ne rabiš znati vsega danes.</p>\n<p>Pomembno je, da začneš razmišljati kot nekdo, ki rešuje problem, ne kot nekdo, ki pripravlja kampanjo.</p>\n<p>Tudi sam nisem začel kjer sem zdaj. Smer se izoblikuje skozi prakso. Važno je konstantno učenje.</p>\n\n<div style=\"background:#f3f4f6;padding:20px;border-radius:8px;margin-top:24px;\">\n  <p style=\"margin-top:0;\"><strong>Mini izziv:</strong></p>\n  <p>Analiziraj onboarding naše aplikacije MojaPošta.</p>\n  <ul>\n    <li>Katere 3 izboljšave bi predlagal/a za povečanje aktivacije?</li>\n    <li>Utemelji jih s poslovno logiko.</li>\n    <li>Razmisli tudi, katere podatke bi pri svoji odločitvi potreboval/a?</li>\n  </ul>\n</div>"
      },
      "results": {
        "subject": "Kateremu profilu se nagiba tvoje generacija?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Tukaj je razporeditev profilov:</p>\n<ul>{{resultsHtml}}</ul>\n<p>Produkt brez jasne vrednosti ne preživi. Produkt z jasno logiko postane sistem.</p>\n<p>Ko lahko skoraj vsak razvije produkt, ni več vprašanje kako, ampak zakaj. Razlika med povprečnim in izjemnim produktom pa ne bo v tem, kdo ga zna sestaviti, ampak kdo zna jasno definirati problem, vrednost in razlog, zakaj naj ga nekdo uporablja.</p>\n<p>Ko lahko skoraj vsak nekaj razvije produkt, tehnologija sama po sebi ni več prednost. Prednost postane marketing kot sposobnost, ki zna izdelek postaviti v kontekst, mu dati pomen in ga povezati z realno potrebo. Ali pa jo celo ustvariti.</p>"
      },
      "reminder": {
        "subject": "Si izboljšal/a onboarding?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Si analiziral/a onboarding?</p>\n<p>Pošlji mi svoje 3 predloge in poslovno utemeljitev. Nič ni narobe z idejami, ampak argumenti so boljši. Če pa še priložiš nabor podatkov, ki bi jih potreboval/a pri odločitvi, pa si že zdaj pravi profil za produktni marketing.</p>\n<p><a href=\"{{mailtoLink}}\" style=\"display:inline-block;padding:12px 24px;background:#22c55e;color:#fff;border-radius:8px;text-decoration:none;\">Pošlji odgovor</a></p>"
      }
    },
    "performance": {
      "immediate": {
        "subject": "Tvoj marketinški profil: Performance marketing",
        "body": "<h1 style=\"color:#f59e0b;\">Zdravo {{name}}!</h1>\n<p>Izbral/a si performance marketing. Rezultat je tvoja valuta.</p>\n\n<p><strong>Začni pri osnovah:</strong></p>\n<ul>\n  <li>razumi celoten konverzijski lijak,</li>\n  <li>testiraj eno spremenljivko naenkrat,</li>\n  <li>optimiziraj le z jasno hipotezo.</li>\n</ul>\n\n<p><strong>Na področju AI se osredotoči na:</strong></p>\n<ul>\n  <li>generiranje in testiranje oglasnih kreativ,</li>\n  <li>avtomatsko optimizacijo bidding strategij,</li>\n  <li>iskanje anomalij v kampanjah.</li>\n</ul>\n\n<p><strong>Uporabne AI rešitve:</strong></p>\n<ul>\n  <li>Meta Advantage+ in Google Performance Max</li>\n  <li>ChatGPT za generiranje oglasnih variacij (vsebina)</li>\n  <li>AdCreative.ai ali podobno orodje za kreative (Nano Banana Pro ima zelo dobro razmerje med ceno in rezultatom)</li>\n  <li>Supermetrics + AI analiza podatkov</li>\n  <li>Looker Studio za izdelavo lastnega dashboarda</li>\n  <li>BigQuery sandbox (brezplačna verzija) za osnovno delo s podatki</li>\n</ul>\n\n<p>Če želiš iti korak dlje, lahko eksperimentiraš tudi z open-source orodji ali brezplačnimi trial verzijami naprednejših platform.</p>\n<p>Ključno pa je, da razumeš logiko merjenja in atribucije, ne le uporabo orodja.</p>\n<p>Če ti vse skupaj deluje kompleksno, se ne vstraši. Performance marketing ni klikanje gumbov, ampak strukturirano testiranje.</p>\n<p>Začni z majhnim testom. Praksa je pomembnejša od perfekcije. Si dovolj zgodaj v procesu, da lahko v miru pridobiš prava znanja.</p>\n\n<div style=\"background:#f3f4f6;padding:20px;border-radius:8px;margin-top:24px;\">\n  <p style=\"margin-top:0;\"><strong>Mini izziv:</strong></p>\n  <p>Zasnovaj preprost A/B test za promocijo mobilne aplikacije MojaPošta.</p>\n  <ul>\n    <li>Kaj testiraš?</li>\n    <li>Kako meriš uspeh?</li>\n    <li>Kdaj test ustaviš?</li>\n  </ul>\n  <p>En pomemben nasvet! Pri A/B testu spreminjaš samo 1, do max 2 elementa (če sta smiselno povezana). Vse kar je več, ne boš vedel/a, kateri je razlog za boljši/slabši rezultat.</p>\n</div>"
      },
      "results": {
        "subject": "Rezultati ankete – pogled v performance",
        "body": "<h1>Zdravo {{name}}.</h1>\n<p>Tukaj je razdelitev profilov:</p>\n<ul>{{resultsHtml}}</ul>\n<p>Performance brez sistema je samo trošenje proračuna. Performance s sistemom pa prinaša prave rezultate.</p>\n<p>Ko lahko skoraj vsak zažene oglas in uporabi enaka AI orodja, bo razlika v tem, kdo zna oglaševanje povezati z realno poslovno logiko, vrednostjo za uporabnika in dolgoročno strategijo.</p>"
      },
      "reminder": {
        "subject": "Si izvedel/a A/B test?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Si postavil/a test in definiral/a metrike?</p>\n<p>Pošlji mi strukturo testa in svojo hipotezo. Če nimaš jasnega cilja in jasno zapisane predpostavke, potem ne optimiziraš ampak samo ugibaš.</p>\n<p><a href=\"{{mailtoLink}}\" style=\"display:inline-block;padding:12px 24px;background:#f59e0b;color:#fff;border-radius:8px;text-decoration:none;\">Pošlji odgovor</a></p>"
      }
    },
    "ne_vem": {
      "immediate": {
        "subject": "Dobrodošel/a v svetu marketinga",
        "body": "<h1 style=\"color:#8b5cf6;\">Zdravo {{name}}!</h1>\n<p>Izbral/a si možnost \"še ne vem\". To ne pomeni, da nimaš smeri. Lahko pomeni, da razmišljaš širše.</p>\n<p>Marketing ni ena stvar. Je kombinacija:</p>\n<ul>\n  <li>podatkov,</li>\n  <li>produkta,</li>\n  <li>komunikacije,</li>\n  <li>sistema.</li>\n</ul>\n\n<p>Tak profil pogosto postane generalist. Pa pozabi na tisto frazo: \"Jack of all trades, master of none\". Ta izvira še iz 17. stoletja. Nekateri pa jo še vedno radi citirajo, ampak žal v napačnem obdobju.</p>\n<p>Generalist je v današnjem poslovnem okolju izjemno dragocen, ker razume povezave med posameznimi področji, ne samo enega segmenta.</p>\n<p>V svetu, kjer so oddelki vedno bolj prepleteni, je prav širok pogled pogosto strateška prednost. Tisti, ki vidijo celoto, pogosto določajo smer in ne izvajajo samo posamezne naloge.</p>\n\n<p><strong>Če še ne veš, kam se usmeriti, se pri AI osredotoči na osnove:</strong></p>\n<ul>\n  <li>razumevanje, kako delujejo veliki jezikovni modeli (LLM)</li>\n  <li>kako postaviti dober prompt</li>\n  <li>kako AI povezati z realnimi podatki (npr. preko API-jev)</li>\n  <li>razlika med determinističnim in verjetnostnim pristopom pri avtomatizaciji (pravila \"če A, potem B\" vs. modeli, ki ocenjujejo verjetnost) ter kdaj uporabiti katerega</li>\n</ul>\n\n<p><strong>Uporabne AI rešitve za začetek:</strong></p>\n<ul>\n  <li>ChatGPT, Gemini ali Claude za vsakodnevno učenje in eksperimentiranje</li>\n  <li>Perplexity za raziskovanje tem in virov</li>\n  <li>n8n, Zapier ali Make za povezovanje AI z realnimi podatki</li>\n  <li>Notion AI za strukturiranje znanja in zapiskov</li>\n</ul>\n\n<p>Ne ustraši se, če trenutno nimaš jasne smeri. Večina ljudi je nima pri 20 letih. Pomembno je, da začneš raziskovati sistem in opazovati, kaj te res pritegne.</p>\n<p>Tudi sam nisem vedel, kam točno sodim. Smer se izoblikuje skozi prakso, ne skozi en sam odgovor v anketi.</p>\n\n<div style=\"background:#f3f4f6;padding:20px;border-radius:8px;margin-top:24px;\">\n  <p style=\"margin-top:0;\"><strong>Mini izziv:</strong></p>\n  <p>Poglej našo digitalno storitev, mobilno aplikacijo MojaPošta.</p>\n  <p>Poskusi jo analizirati kot sistem:</p>\n  <ul>\n    <li>Katere podatke zbira?</li>\n    <li>Kako komunicira?</li>\n    <li>Kaj avtomatizira?</li>\n    <li>Kje vidiš prostor za izboljšavo?</li>\n  </ul>\n</div>"
      },
      "results": {
        "subject": "Kako razmišlja tvoja generacija?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Spodaj je porazdelitev odgovorov:</p>\n<ul>{{resultsHtml}}</ul>\n<p>Če še ne veš, kam se usmeriti, začni z razumevanjem sistema. Profil pride kasneje, imaš čas.</p>\n<p>Generalist vidi širšo sliko. V podjetjih, kjer so podatki, produkt in komunikacija povezani, je prav tak profil pogosto most med oddelki.</p>\n<p>V prihodnosti bo znanje razvoja produktov in uporabe orodij vedno bolj dostopno. Razumevanje problema, vrednosti in konteksta pa ne.</p>\n<p>Ne išči najprej orodja. Išči problem, ki ga je vredno rešiti. Ko razumeš problem, boš tudi znal izbrati pravilno orodje.</p>"
      },
      "reminder": {
        "subject": "Si že bližje svojemu profilu?",
        "body": "<h1>Zdravo {{name}}!</h1>\n<p>Si analiziral/a mobilno aplikacijo MojaPošta?</p>\n<p>Če si jo, mi v 5–7 stavkih pošlji svoj pogled:</p>\n<ul>\n  <li>Kje vidiš, da sistem deluje dobro? Kje slabo?</li>\n  <li>Kako bi ga izboljšal/a in zakaj?</li>\n</ul>\n<p>Ključno vprašanje v tem trenutku ni bilo, ali imaš prav. Ključno je, ali si poskusil/a videti širšo sliko.</p>\n<p>To je delo generalista. Povezati podatke, produkt, komunikacijo in avtomatizacijo v eno celoto.</p>\n<p><a href=\"{{mailtoLink}}\" style=\"display:inline-block;padding:12px 24px;background:#8b5cf6;color:#fff;border-radius:8px;text-decoration:none;\">Pošlji odgovor</a></p>"
      }
    }
  }
}
